ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/boards.txt
################################################################################
# ILOGICS MPINO / MPAINO 시리즈 보드 정의 파일
#
# 본 파일은 Arduino IDE에서 ㈜아이로직스(ILOGICS)의 산업용 Arduino 호환 PLC
# 보드를 사용할 수 있도록 보드 정보를 정의합니다.
#
#   설치 경로 예: <Arduino 설치 폴더>/hardware/ilogics/avr/boards.txt
#
# 지원 보드군:
#   - MPINO  시리즈 (ATmega128 기반): MPINO-8A4R(T)-S 등
#   - MPINO  시리즈 (ATmega2560 기반): MPINO-8A8R 등
#   - MPAINO 시리즈 (ATmega2560 기반): MPAINO-8A8R(T), MPAINO-64A64R(T) 등
#
# 모든 보드는 16MHz 동작, UART0 (115200bps)을 통한 시리얼 업로드를 사용합니다.
# 문의: ㈜아이로직스 (ILOGICS)
################################################################################

################################################################################
# ATmega128 기반 MPINO 보드
################################################################################

#########################
####  MPINO-8A4R(T)-S
#########################
# MCU: ATmega128 / Flash 128KB(사용 가능 130,048B) / SRAM 4KB / 16MHz
# 업로드: UART0 (115200bps), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
8A4R_S.name=MPINO-8A4R(T)-S

# --- 업로드 설정 ---
8A4R_S.upload.tool=avrdude
8A4R_S.upload.protocol=arduino
8A4R_S.upload.maximum_size=130048
8A4R_S.upload.maximum_data_size=4096
8A4R_S.upload.speed=115200
8A4R_S.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
8A4R_S.bootloader.tool=avrdude
8A4R_S.bootloader.unlock_bits=0x3F
8A4R_S.bootloader.lock_bits=0x3C
8A4R_S.bootloader.low_fuses=0xBF
8A4R_S.bootloader.high_fuses=0xCC
8A4R_S.bootloader.extended_fuses=0xFF

# --- 빌드 설정 ---
8A4R_S.build.core=MCUdude_corefiles
8A4R_S.build.variant=8A4R-S
8A4R_S.build.board=AVR_ATmega128
8A4R_S.build.mcu=atmega128
8A4R_S.build.f_cpu=16000000L
8A4R_S.build.bootloader_led=E2
8A4R_S.build.extra_flags=-DM8A4RS

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
8A4R_S.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
8A4R_S.bootloader.uart0=Serial
8A4R_S.bootloader.upload.protocol=arduino
8A4R_S.bootloader.upload.port=UART0
8A4R_S.bootloader.upload.speed=115200
8A4R_S.bootloader.build.export_merged_output=true
8A4R_S.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPINO-8A4R-SU
#########################
# MCU: ATmega128 / Flash 128KB(사용 가능 130,048B) / SRAM 4KB / 16MHz
# 업로드: UART0 (115200bps), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
8A4R_SU.name=MPINO-8A4R-SU

# --- 업로드 설정 ---
8A4R_SU.upload.tool=avrdude
8A4R_SU.upload.protocol=arduino
8A4R_SU.upload.maximum_size=130048
8A4R_SU.upload.maximum_data_size=4096
8A4R_SU.upload.speed=115200
8A4R_SU.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
8A4R_SU.bootloader.tool=avrdude
8A4R_SU.bootloader.unlock_bits=0x3F
8A4R_SU.bootloader.lock_bits=0x3C
8A4R_SU.bootloader.low_fuses=0xBF
8A4R_SU.bootloader.high_fuses=0xCC
8A4R_SU.bootloader.extended_fuses=0xFF

# --- 빌드 설정 ---
8A4R_SU.build.core=MCUdude_corefiles
8A4R_SU.build.variant=8A4R-SU
8A4R_SU.build.board=AVR_ATmega128
8A4R_SU.build.mcu=atmega128
8A4R_SU.build.f_cpu=16000000L
8A4R_SU.build.bootloader_led=E2
8A4R_SU.build.extra_flags=-DM8A4RSU

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
8A4R_SU.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
8A4R_SU.bootloader.uart0=Serial
8A4R_SU.bootloader.upload.protocol=arduino
8A4R_SU.bootloader.upload.port=UART0
8A4R_SU.bootloader.upload.speed=115200
8A4R_SU.bootloader.build.export_merged_output=true
8A4R_SU.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPINO-8A8R(T)-S
#########################
# MCU: ATmega128 / Flash 128KB(사용 가능 130,048B) / SRAM 4KB / 16MHz
# 업로드: UART0 (115200bps), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
8A8R_S.name=MPINO-8A8R(T)-S

# --- 업로드 설정 ---
8A8R_S.upload.tool=avrdude
8A8R_S.upload.protocol=arduino
8A8R_S.upload.maximum_size=130048
8A8R_S.upload.maximum_data_size=4096
8A8R_S.upload.speed=115200
8A8R_S.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
8A8R_S.bootloader.tool=avrdude
8A8R_S.bootloader.unlock_bits=0x3F
8A8R_S.bootloader.lock_bits=0x3C
8A8R_S.bootloader.low_fuses=0xBF
8A8R_S.bootloader.high_fuses=0xCC
8A8R_S.bootloader.extended_fuses=0xFF

# --- 빌드 설정 ---
8A8R_S.build.core=MCUdude_corefiles
8A8R_S.build.variant=8A8R-S
8A8R_S.build.board=AVR_ATmega128
8A8R_S.build.mcu=atmega128
8A8R_S.build.f_cpu=16000000L
8A8R_S.build.bootloader_led=E2
8A8R_S.build.extra_flags=-DM8A8RS

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
8A8R_S.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
8A8R_S.bootloader.uart0=Serial
8A8R_S.bootloader.upload.protocol=arduino
8A8R_S.bootloader.upload.port=UART0
8A8R_S.bootloader.upload.speed=115200
8A8R_S.bootloader.build.export_merged_output=true
8A8R_S.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPINO-16A16R(T)
#########################
# MCU: ATmega128 / Flash 128KB(사용 가능 130,048B) / SRAM 4KB / 16MHz
# 업로드: UART0 (115200bps), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
16A16R.name=MPINO-16A16R(T)

# --- 업로드 설정 ---
16A16R.upload.tool=avrdude
16A16R.upload.protocol=arduino
16A16R.upload.maximum_size=130048
16A16R.upload.maximum_data_size=4096
16A16R.upload.speed=115200
16A16R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
16A16R.bootloader.tool=avrdude
16A16R.bootloader.unlock_bits=0x3F
16A16R.bootloader.lock_bits=0x3C
16A16R.bootloader.low_fuses=0xBF
16A16R.bootloader.high_fuses=0xCC
16A16R.bootloader.extended_fuses=0xFF

# --- 빌드 설정 ---
16A16R.build.core=MCUdude_corefiles
16A16R.build.variant=16A16R
16A16R.build.board=AVR_ATmega128
16A16R.build.mcu=atmega128
16A16R.build.f_cpu=16000000L
16A16R.build.bootloader_led=E2
16A16R.build.extra_flags=-DM16A16R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
16A16R.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
16A16R.bootloader.uart0=Serial
16A16R.bootloader.upload.protocol=arduino
16A16R.bootloader.upload.port=UART0
16A16R.bootloader.upload.speed=115200
16A16R.bootloader.build.export_merged_output=true
16A16R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

################################################################################
# ATmega2560 기반 MPINO / MPAINO 보드
################################################################################

#########################
####  MPINO-8A8R
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPINO8A8R.name=MPINO-8A8R

# --- 업로드 설정 ---
MPINO8A8R.upload.tool=avrdude
MPINO8A8R.upload.protocol=wiring
MPINO8A8R.upload.maximum_size=261120
MPINO8A8R.upload.maximum_data_size=8192
MPINO8A8R.upload.speed=115200
MPINO8A8R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPINO8A8R.bootloader.tool=avrdude
MPINO8A8R.bootloader.unlock_bits=0x3F
MPINO8A8R.bootloader.lock_bits=0x3C
MPINO8A8R.bootloader.low_fuses=0xFF
MPINO8A8R.bootloader.high_fuses=0xD8
MPINO8A8R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPINO8A8R.build.core=MCUdude_corefiles
MPINO8A8R.build.variant=MPINO_2560
MPINO8A8R.build.board=AVR_ATmega2560
MPINO8A8R.build.mcu=atmega2560
MPINO8A8R.build.f_cpu=16000000L
MPINO8A8R.build.bootloader_led=B7
MPINO8A8R.build.extra_flags=-DM8A8R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPINO8A8R.ltoarcmd=avr-ar

