ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/boards.txt
# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPINO8A8R.bootloader.uart0=Serial
MPINO8A8R.bootloader.upload.protocol=wiring
MPINO8A8R.bootloader.upload.port=UART0
MPINO8A8R.bootloader.upload.speed=115200
MPINO8A8R.bootloader.build.export_merged_output=true
MPINO8A8R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPINO-16A8R
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPINO16A8R.name=MPINO-16A8R

# --- 업로드 설정 ---
MPINO16A8R.upload.tool=avrdude
MPINO16A8R.upload.protocol=wiring
MPINO16A8R.upload.maximum_size=261120
MPINO16A8R.upload.maximum_data_size=8192
MPINO16A8R.upload.speed=115200
MPINO16A8R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPINO16A8R.bootloader.tool=avrdude
MPINO16A8R.bootloader.unlock_bits=0x3F
MPINO16A8R.bootloader.lock_bits=0x3C
MPINO16A8R.bootloader.low_fuses=0xFF
MPINO16A8R.bootloader.high_fuses=0xD8
MPINO16A8R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPINO16A8R.build.core=MCUdude_corefiles
MPINO16A8R.build.variant=MPINO_2560
MPINO16A8R.build.board=AVR_ATmega2560
MPINO16A8R.build.mcu=atmega2560
MPINO16A8R.build.f_cpu=16000000L
MPINO16A8R.build.bootloader_led=B7
MPINO16A8R.build.extra_flags=-DM16A8R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPINO16A8R.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPINO16A8R.bootloader.uart0=Serial
MPINO16A8R.bootloader.upload.protocol=wiring
MPINO16A8R.bootloader.upload.port=UART0
MPINO16A8R.bootloader.upload.speed=115200
MPINO16A8R.bootloader.build.export_merged_output=true
MPINO16A8R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPINO-16A8R8T
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPINO16A8R8T.name=MPINO-16A8R8T

# --- 업로드 설정 ---
MPINO16A8R8T.upload.tool=avrdude
MPINO16A8R8T.upload.protocol=wiring
MPINO16A8R8T.upload.maximum_size=261120
MPINO16A8R8T.upload.maximum_data_size=8192
MPINO16A8R8T.upload.speed=115200
MPINO16A8R8T.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPINO16A8R8T.bootloader.tool=avrdude
MPINO16A8R8T.bootloader.unlock_bits=0x3F
MPINO16A8R8T.bootloader.lock_bits=0x3C
MPINO16A8R8T.bootloader.low_fuses=0xFF
MPINO16A8R8T.bootloader.high_fuses=0xD8
MPINO16A8R8T.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPINO16A8R8T.build.core=MCUdude_corefiles
MPINO16A8R8T.build.variant=MPINO_2560
MPINO16A8R8T.build.board=AVR_ATmega2560
MPINO16A8R8T.build.mcu=atmega2560
MPINO16A8R8T.build.f_cpu=16000000L
MPINO16A8R8T.build.bootloader_led=B7
MPINO16A8R8T.build.extra_flags=-DM16A8R8T

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPINO16A8R8T.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPINO16A8R8T.bootloader.uart0=Serial
MPINO16A8R8T.bootloader.upload.protocol=wiring
MPINO16A8R8T.bootloader.upload.port=UART0
MPINO16A8R8T.bootloader.upload.speed=115200
MPINO16A8R8T.bootloader.build.export_merged_output=true
MPINO16A8R8T.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-8A8R(T)
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO8A8R.name=MPAINO-8A8R(T)

# --- 업로드 설정 ---
MPAINO8A8R.upload.tool=avrdude
MPAINO8A8R.upload.protocol=wiring
MPAINO8A8R.upload.maximum_size=261120
MPAINO8A8R.upload.maximum_data_size=8192
MPAINO8A8R.upload.speed=115200
MPAINO8A8R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO8A8R.bootloader.tool=avrdude
MPAINO8A8R.bootloader.unlock_bits=0x3F
MPAINO8A8R.bootloader.lock_bits=0x3C
MPAINO8A8R.bootloader.low_fuses=0xFF
MPAINO8A8R.bootloader.high_fuses=0xD8
MPAINO8A8R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO8A8R.build.core=MCUdude_corefiles
MPAINO8A8R.build.variant=MPINO_2560
MPAINO8A8R.build.board=AVR_ATmega2560
MPAINO8A8R.build.mcu=atmega2560
MPAINO8A8R.build.f_cpu=16000000L
MPAINO8A8R.build.bootloader_led=B7
MPAINO8A8R.build.extra_flags=-DMP8A8R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO8A8R.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO8A8R.bootloader.uart0=Serial
MPAINO8A8R.bootloader.upload.protocol=wiring
MPAINO8A8R.bootloader.upload.port=UART0
MPAINO8A8R.bootloader.upload.speed=115200
MPAINO8A8R.bootloader.build.export_merged_output=true
MPAINO8A8R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-16A16R(T)
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO16A16R.name=MPAINO-16A16R(T)

# --- 업로드 설정 ---
MPAINO16A16R.upload.tool=avrdude
MPAINO16A16R.upload.protocol=wiring
MPAINO16A16R.upload.maximum_size=261120
MPAINO16A16R.upload.maximum_data_size=8192
MPAINO16A16R.upload.speed=115200
MPAINO16A16R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO16A16R.bootloader.tool=avrdude
MPAINO16A16R.bootloader.unlock_bits=0x3F
MPAINO16A16R.bootloader.lock_bits=0x3C
MPAINO16A16R.bootloader.low_fuses=0xFF
MPAINO16A16R.bootloader.high_fuses=0xD8
MPAINO16A16R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO16A16R.build.core=MCUdude_corefiles
MPAINO16A16R.build.variant=MPINO_2560
MPAINO16A16R.build.board=AVR_ATmega2560
MPAINO16A16R.build.mcu=atmega2560
MPAINO16A16R.build.f_cpu=16000000L
MPAINO16A16R.build.bootloader_led=B7
MPAINO16A16R.build.extra_flags=-DMP16A16R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO16A16R.ltoarcmd=avr-ar

