ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/boards.txt
# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO16A16R.bootloader.uart0=Serial
MPAINO16A16R.bootloader.upload.protocol=wiring
MPAINO16A16R.bootloader.upload.port=UART0
MPAINO16A16R.bootloader.upload.speed=115200
MPAINO16A16R.bootloader.build.export_merged_output=true
MPAINO16A16R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-32A16R(T)
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO32A16R.name=MPAINO-32A16R(T)

# --- 업로드 설정 ---
MPAINO32A16R.upload.tool=avrdude
MPAINO32A16R.upload.protocol=wiring
MPAINO32A16R.upload.maximum_size=261120
MPAINO32A16R.upload.maximum_data_size=8192
MPAINO32A16R.upload.speed=115200
MPAINO32A16R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO32A16R.bootloader.tool=avrdude
MPAINO32A16R.bootloader.unlock_bits=0x3F
MPAINO32A16R.bootloader.lock_bits=0x3C
MPAINO32A16R.bootloader.low_fuses=0xFF
MPAINO32A16R.bootloader.high_fuses=0xD8
MPAINO32A16R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO32A16R.build.core=MCUdude_corefiles
MPAINO32A16R.build.variant=MPAINO_2560
MPAINO32A16R.build.board=AVR_ATmega2560
MPAINO32A16R.build.mcu=atmega2560
MPAINO32A16R.build.f_cpu=16000000L
MPAINO32A16R.build.bootloader_led=B7
MPAINO32A16R.build.extra_flags=-DMP32A16R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO32A16R.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO32A16R.bootloader.uart0=Serial
MPAINO32A16R.bootloader.upload.protocol=wiring
MPAINO32A16R.bootloader.upload.port=UART0
MPAINO32A16R.bootloader.upload.speed=115200
MPAINO32A16R.bootloader.build.export_merged_output=true
MPAINO32A16R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-16A32R(T)
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO16A32R.name=MPAINO-16A32R(T)

# --- 업로드 설정 ---
MPAINO16A32R.upload.tool=avrdude
MPAINO16A32R.upload.protocol=wiring
MPAINO16A32R.upload.maximum_size=261120
MPAINO16A32R.upload.maximum_data_size=8192
MPAINO16A32R.upload.speed=115200
MPAINO16A32R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO16A32R.bootloader.tool=avrdude
MPAINO16A32R.bootloader.unlock_bits=0x3F
MPAINO16A32R.bootloader.lock_bits=0x3C
MPAINO16A32R.bootloader.low_fuses=0xFF
MPAINO16A32R.bootloader.high_fuses=0xD8
MPAINO16A32R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO16A32R.build.core=MCUdude_corefiles
MPAINO16A32R.build.variant=MPAINO_2560
MPAINO16A32R.build.board=AVR_ATmega2560
MPAINO16A32R.build.mcu=atmega2560
MPAINO16A32R.build.f_cpu=16000000L
MPAINO16A32R.build.bootloader_led=B7
MPAINO16A32R.build.extra_flags=-DMP16A32R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO16A32R.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO16A32R.bootloader.uart0=Serial
MPAINO16A32R.bootloader.upload.protocol=wiring
MPAINO16A32R.bootloader.upload.port=UART0
MPAINO16A32R.bootloader.upload.speed=115200
MPAINO16A32R.bootloader.build.export_merged_output=true
MPAINO16A32R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-24A24R(T)
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO24A24R.name=MPAINO-24A24R(T)

# --- 업로드 설정 ---
MPAINO24A24R.upload.tool=avrdude
MPAINO24A24R.upload.protocol=wiring
MPAINO24A24R.upload.maximum_size=261120
MPAINO24A24R.upload.maximum_data_size=8192
MPAINO24A24R.upload.speed=115200
MPAINO24A24R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO24A24R.bootloader.tool=avrdude
MPAINO24A24R.bootloader.unlock_bits=0x3F
MPAINO24A24R.bootloader.lock_bits=0x3C
MPAINO24A24R.bootloader.low_fuses=0xFF
MPAINO24A24R.bootloader.high_fuses=0xD8
MPAINO24A24R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO24A24R.build.core=MCUdude_corefiles
MPAINO24A24R.build.variant=MPAINO_2560
MPAINO24A24R.build.board=AVR_ATmega2560
MPAINO24A24R.build.mcu=atmega2560
MPAINO24A24R.build.f_cpu=16000000L
MPAINO24A24R.build.bootloader_led=B7
MPAINO24A24R.build.extra_flags=-DMP24A24R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO24A24R.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO24A24R.bootloader.uart0=Serial
MPAINO24A24R.bootloader.upload.protocol=wiring
MPAINO24A24R.bootloader.upload.port=UART0
MPAINO24A24R.bootloader.upload.speed=115200
MPAINO24A24R.bootloader.build.export_merged_output=true
MPAINO24A24R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-32A32R(T)
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO32A32R.name=MPAINO-32A32R(T)

# --- 업로드 설정 ---
MPAINO32A32R.upload.tool=avrdude
MPAINO32A32R.upload.protocol=wiring
MPAINO32A32R.upload.maximum_size=261120
MPAINO32A32R.upload.maximum_data_size=8192
MPAINO32A32R.upload.speed=115200
MPAINO32A32R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO32A32R.bootloader.tool=avrdude
MPAINO32A32R.bootloader.unlock_bits=0x3F
MPAINO32A32R.bootloader.lock_bits=0x3C
MPAINO32A32R.bootloader.low_fuses=0xFF
MPAINO32A32R.bootloader.high_fuses=0xD8
MPAINO32A32R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO32A32R.build.core=MCUdude_corefiles
MPAINO32A32R.build.variant=MPAINO_2560
MPAINO32A32R.build.board=AVR_ATmega2560
MPAINO32A32R.build.mcu=atmega2560
MPAINO32A32R.build.f_cpu=16000000L
MPAINO32A32R.build.bootloader_led=B7
MPAINO32A32R.build.extra_flags=-DMP32A32R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO32A32R.ltoarcmd=avr-ar

