ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/boards.txt
# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO32A32R.bootloader.uart0=Serial
MPAINO32A32R.bootloader.upload.protocol=wiring
MPAINO32A32R.bootloader.upload.port=UART0
MPAINO32A32R.bootloader.upload.speed=115200
MPAINO32A32R.bootloader.build.export_merged_output=true
MPAINO32A32R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-48A48R(T)
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO48A48R.name=MPAINO-48A48R(T)

# --- 업로드 설정 ---
MPAINO48A48R.upload.tool=avrdude
MPAINO48A48R.upload.protocol=wiring
MPAINO48A48R.upload.maximum_size=261120
MPAINO48A48R.upload.maximum_data_size=8192
MPAINO48A48R.upload.speed=115200
MPAINO48A48R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO48A48R.bootloader.tool=avrdude
MPAINO48A48R.bootloader.unlock_bits=0x3F
MPAINO48A48R.bootloader.lock_bits=0x3C
MPAINO48A48R.bootloader.low_fuses=0xFF
MPAINO48A48R.bootloader.high_fuses=0xD8
MPAINO48A48R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO48A48R.build.core=MCUdude_corefiles
MPAINO48A48R.build.variant=MPAINO_2560_S
MPAINO48A48R.build.board=AVR_ATmega2560
MPAINO48A48R.build.mcu=atmega2560
MPAINO48A48R.build.f_cpu=16000000L
MPAINO48A48R.build.bootloader_led=B7
MPAINO48A48R.build.extra_flags=-DM48A48R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO48A48R.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO48A48R.bootloader.uart0=Serial
MPAINO48A48R.bootloader.upload.protocol=wiring
MPAINO48A48R.bootloader.upload.port=UART0
MPAINO48A48R.bootloader.upload.speed=115200
MPAINO48A48R.bootloader.build.export_merged_output=true
MPAINO48A48R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-64A64R(T)
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO64A64R.name=MPAINO-64A64R(T)

# --- 업로드 설정 ---
MPAINO64A64R.upload.tool=avrdude
MPAINO64A64R.upload.protocol=wiring
MPAINO64A64R.upload.maximum_size=261120
MPAINO64A64R.upload.maximum_data_size=8192
MPAINO64A64R.upload.speed=115200
MPAINO64A64R.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO64A64R.bootloader.tool=avrdude
MPAINO64A64R.bootloader.unlock_bits=0x3F
MPAINO64A64R.bootloader.lock_bits=0x3C
MPAINO64A64R.bootloader.low_fuses=0xFF
MPAINO64A64R.bootloader.high_fuses=0xD8
MPAINO64A64R.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO64A64R.build.core=MCUdude_corefiles
MPAINO64A64R.build.variant=MPAINO_2560_S
MPAINO64A64R.build.board=AVR_ATmega2560
MPAINO64A64R.build.mcu=atmega2560
MPAINO64A64R.build.f_cpu=16000000L
MPAINO64A64R.build.bootloader_led=B7
MPAINO64A64R.build.extra_flags=-DM64A64R

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO64A64R.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO64A64R.bootloader.uart0=Serial
MPAINO64A64R.bootloader.upload.protocol=wiring
MPAINO64A64R.bootloader.upload.port=UART0
MPAINO64A64R.bootloader.upload.speed=115200
MPAINO64A64R.bootloader.build.export_merged_output=true
MPAINO64A64R.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-48A48R(T)-OLD
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO48A48ROLD.name=MPAINO-48A48R(T)-OLD

# --- 업로드 설정 ---
MPAINO48A48ROLD.upload.tool=avrdude
MPAINO48A48ROLD.upload.protocol=wiring
MPAINO48A48ROLD.upload.maximum_size=261120
MPAINO48A48ROLD.upload.maximum_data_size=8192
MPAINO48A48ROLD.upload.speed=115200
MPAINO48A48ROLD.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO48A48ROLD.bootloader.tool=avrdude
MPAINO48A48ROLD.bootloader.unlock_bits=0x3F
MPAINO48A48ROLD.bootloader.lock_bits=0x3C
MPAINO48A48ROLD.bootloader.low_fuses=0xFF
MPAINO48A48ROLD.bootloader.high_fuses=0xD8
MPAINO48A48ROLD.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO48A48ROLD.build.core=MCUdude_corefiles
MPAINO48A48ROLD.build.variant=MPAINO_2560_S
MPAINO48A48ROLD.build.board=AVR_ATmega2560
MPAINO48A48ROLD.build.mcu=atmega2560
MPAINO48A48ROLD.build.f_cpu=16000000L
MPAINO48A48ROLD.build.bootloader_led=B7
MPAINO48A48ROLD.build.extra_flags=-DM48A48R_OLD

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO48A48ROLD.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO48A48ROLD.bootloader.uart0=Serial
MPAINO48A48ROLD.bootloader.upload.protocol=wiring
MPAINO48A48ROLD.bootloader.upload.port=UART0
MPAINO48A48ROLD.bootloader.upload.speed=115200
MPAINO48A48ROLD.bootloader.build.export_merged_output=true
MPAINO48A48ROLD.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

#########################
####  MPAINO-64A64R(T)-OLD
#########################
# MCU: ATmega2560 / Flash 256KB(사용 가능 261,120B) / SRAM 8KB / 16MHz
# 업로드: UART0 (115200bps, wiring 프로토콜), Optiboot BIGBOOT 부트로더

# --- 기본 정보 ---
MPAINO64A64ROLD.name=MPAINO-64A64R(T)-OLD

# --- 업로드 설정 ---
MPAINO64A64ROLD.upload.tool=avrdude
MPAINO64A64ROLD.upload.protocol=wiring
MPAINO64A64ROLD.upload.maximum_size=261120
MPAINO64A64ROLD.upload.maximum_data_size=8192
MPAINO64A64ROLD.upload.speed=115200
MPAINO64A64ROLD.upload.port=UART0

# --- 부트로더 굽기용 퓨즈/락 비트 ---
MPAINO64A64ROLD.bootloader.tool=avrdude
MPAINO64A64ROLD.bootloader.unlock_bits=0x3F
MPAINO64A64ROLD.bootloader.lock_bits=0x3C
MPAINO64A64ROLD.bootloader.low_fuses=0xFF
MPAINO64A64ROLD.bootloader.high_fuses=0xD8
MPAINO64A64ROLD.bootloader.extended_fuses=0xFD

# --- 빌드 설정 ---
MPAINO64A64ROLD.build.core=MCUdude_corefiles
MPAINO64A64ROLD.build.variant=MPAINO_2560_S
MPAINO64A64ROLD.build.board=AVR_ATmega2560
MPAINO64A64ROLD.build.mcu=atmega2560
MPAINO64A64ROLD.build.f_cpu=16000000L
MPAINO64A64ROLD.build.bootloader_led=B7
MPAINO64A64ROLD.build.extra_flags=-DM64A64R_OLD

# 아카이브 도구 (platform.txt의 {ltoarcmd} 변수에 사용됨)
MPAINO64A64ROLD.ltoarcmd=avr-ar

# --- 부트로더 hex 경로 (Tools > Burn Bootloader 메뉴용) ---
MPAINO64A64ROLD.bootloader.uart0=Serial
MPAINO64A64ROLD.bootloader.upload.protocol=wiring
MPAINO64A64ROLD.bootloader.upload.port=UART0
MPAINO64A64ROLD.bootloader.upload.speed=115200
MPAINO64A64ROLD.bootloader.build.export_merged_output=true
MPAINO64A64ROLD.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}_BIGBOOT.hex

